==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN                                      [1, 4]                    --
├─Sequential: 1-1                        [1, 114, 1, 30]           --
│    └─Conv2d: 2-1                       [1, 484, 22, 30]          --
│    │    └─Conv2d: 3-1                  [1, 30, 484, 22]          540
│    └─BatchNorm2d: 2-2                  [1, 484, 22, 30]          --
│    │    └─BatchNorm2d: 3-2             [1, 30, 22, 484]          60
│    └─Conv2d: 2-3                       [1, 484, 1, 30]           --
│    │    └─Conv2d: 3-3                  [1, 30, 484, 1]           19,800
│    └─BatchNorm2d: 2-4                  [1, 484, 1, 30]           --
│    │    └─BatchNorm2d: 3-4             [1, 30, 1, 484]           60
│    └─Pooling2d: 2-5                    [1, 114, 1, 30]           --
│    │    └─MaxPool2d: 3-5               [1, 30, 114, 1]           --
│    └─Dropout: 2-6                      [1, 114, 1, 30]           --
├─Sequential: 1-2                        [1, 4]                    --
│    └─Flatten: 2-7                      [1, 3420]                 --
│    └─Linear: 2-8                       [1, 18]                   --
│    │    └─Linear: 3-6                  [1, 18]                   61,578
│    └─ELU: 2-9                          [1, 18]                   --
│    └─Dropout: 2-10                     [1, 18]                   --
│    └─Linear: 2-11                      [1, 7]                    --
│    │    └─Linear: 3-7                  [1, 7]                    133
│    └─ELU: 2-12                         [1, 7]                    --
│    └─Linear: 2-13                      [1, 4]                    --
│    │    └─Linear: 3-8                  [1, 4]                    32
│    └─LogSoftmax: 2-14                  [1, 4]                    --
==========================================================================================
Total params: 82,203
Trainable params: 82,203
Non-trainable params: 0
Total mult-adds (M): 15.39
==========================================================================================
Input size (MB): 0.04
Forward/backward pass size (MB): 5.34
Params size (MB): 0.33
Estimated Total Size (MB): 5.72
==========================================================================================